/*!
 * JS Typograph
 * The Javascript Typography Correcter
 *
 * @version   2.2.4 (build 27.01.2013)
 * @author    Даниил Ерошенко "-1.#IND0000" <buffer.overflow.x86@gmail.com> (based on JSTypograf by UnderShot <mail@undershot.ru>)
 * @link      http://www.starwars-galaxy.ru/forum/22-1008-1
 * @license   http://www.freebsd.org/copyright/freebsd-license.html
 *
 * Modified by Иван Метелёв (Ivan Metelev) aka fromanywhere for realtime in-site use
 */

var typo = (function() {
	var TYPO = {
		language: 'rus',
		type: 'html'
	};

	var t = function(option) {
		var avaibleOptions = ['spaces', 'dashs', 'chars', 'quotes', 'nbsp'];
		if ( avaibleOptions.indexOf(option) != '-1') {
			return true;
		}
		return false;
	};

	if(!String.r){
		String.prototype.r = String.prototype.replace;
	}

	function runTypograf(a){
		//\(/[^/]*?[^\\)a]\.[^/]*?/ - используй для поиска регулярок, где ты забыл, что точка это не . а \.
		var s,nbsp,m=[],tag="untypo",w;
		var r=function(a,b){return new RegExp(a,b);};

		/** Используемые символы **/
		var normsym=["—",		"«",		"»",		"…",		"©",		"®",		"™",		"←",		"→",		"↑",		"↓",		"↔",		"°",		"́",			"×",		"≠",		"±",		"↕",		"‘",		"’",		"−",		"–",		"“",		"”",		"„",		"≥",		"≤",		"§",		"€",		"£",		"″",		"√",		"∫",		"½",		"¼",		"¾",		" ",		"‚",		"¹",		"²",		"³",		"⅓",		"⅔",		"⅕",		"⅖",		"⅗",		"⅘",		"⅙",		"⅚",		"⅛",		"⅜",		"⅝",		"⅞",		"≈",		'"',		"⁰",		"⁴",		"⁵",		"⁶",		"⁷",		"⁸",		"⁹",		"⁺",		"⁻",		"⁼",		"⁽",		"⁾",		"ⁿ",		"ⁱ",		"₀",		"₁",		"₂",		"₃",		"₄",		"₅",		"₆",		"₇",		"₈",		"₉",		"₊",		"₋",		"₌",		"₍",		"₎"];
		var htmlsym=["mdash",	"laquo",	"raquo",	"hellip",	"copy",		"reg",		"trade",	"larr",		"rarr",		"uarr",		"darr",		"harr",		"deg",		"#769",		"times",	"ne",		"plusmn",	"#8597",	"lsquo",	"rsquo",	"minus",	"ndash",	"ldquo",	"rdquo",	"bdquo",	"ge",		"le",		"sect",		"euro",		"pound",	"Prime",	"radic",	"int",		"frac12",	"frac14",	"frac34",	"nbsp",		"sbquo",	"sup1",		"sup2",		"sup3",		"#8531",	"#8532",	"#8533",	"#8534",	"#8535",	"#8536",	"#8537",	"#8538",	"#8539",	"#8540",	"#8541",	"#8542",	"#8776",	"quot",		"#8304",	"#8308",	"#8309",	"#8310",	"#8311",	"#8312",	"#8313",	"#8314",	"#8315",	"#8316",	"#8317",	"#8318",	"#8319",	"#8305",	"#8320",	"#8321",	"#8322",	"#8323",	"#8324",	"#8325",	"#8326",	"#8327",	"#8328",	"#8329",	"#8330",	"#8331",	"#8332",	"#8333",	"#8334"];

		/** Регулярки на имейлы и ссылки **/
		var RegLink=r('([  \n\t\v]|^)(((ht|f)tps?://)?([\\-\\w]+:[\\-\\w]+@)?([0-9a-z][\\-0-9a-z]*[0-9a-z]\\.)+[a-z]{2,6}(:\\d{1,5})?([?/\\\\#][?!^$.(){}:|=[\\]+\\-/\\\\*;&~#@,%\\wА-Яа-я]*)?)([  \n\t\v]|$)',"gi");
		var RegMail=r("([  \n\t\v]|^)([\\-a-z0-9!#$%&'*+\\/=?^_`{|}~]+(\\.[\\-a-z0-9!#$%&'*+\\/=?^_`{|}~]+)*@([a-z0-9]([\\-a-z0-9]{0,61}[a-z0-9])?\.)*([a-z]{2,6}))([  \n\t\v]|$)","gi");
		/** Пометка на экранирование тэгов, кодов, цитат и т.п. **/
		a=a.r(/(\r\n|\r)/g,"\n").r(/(\[code\]|\[quote[^\]$\n]*\]|<pre[^<>]*?>|\[img\])/g,"<"+tag+">"+"$1").r(/(\[\/code\]|\[\/quote\]|<\/pre>|\[\/img\])/g,"$1"+"</"+tag+">").r(/(<script[^<>]*?>|<style[^<>]*?>)/g,"<"+tag+">"+"$1").r(/(<\/script>|<\/style>)/g,"$1"+"</"+tag+">").r(/(<!--(.|\n)*?-->)/g,"<"+tag+">"+"$1"+"</"+tag+">").r(/(\[url[^\[\]]+?\])/g,"<"+tag+">"+"$1"+"</"+tag+">").r(/(="[^"\n\r]*")/g,"<"+tag+">"+"$1"+"</"+tag+">");

		/** Удаление вложенных <untypo> **/
		for(var i=0;i<10;++i){
			a=a.r(r("(<"+tag+">)([\\s\\S]*?)(<\\/?"+tag+">)","g"),function($0,$1,$2,$3){
				if($3.charAt(1)!='/'){
					return $1+$2;
				}
				else{
					return $0;
				}
			});
			a=a.r(r("(<\\/"+tag+">)([\\s\\S]*?)(<\\/?"+tag+">)","g"),function($0,$1,$2,$3){
				if($3.charAt(1)=='/'){
					return $2+$3;
				}
				else{
					return $0;
				}
			});
		}

		/** Функция для экранирования **/
		function shield(z){
			s=a.match(r("<"+tag+">[\\s\\S]+?</"+tag+">","g"));
			var i=0;
			if(s){
				for(;i<s.length;i++){
					var re=s[i].r(r("<\\/?"+tag+">","g"),"");
					m.push(re);
					a=a.r("<"+tag+">"+re+"</"+tag+">","UNTYPO"+(i+z)+"S");
				}
			}
			return i+z;
		}
		/** Экранирование **/
		var z=shield(0);
		/** Обработка ссылок **/
		for(var i=0;i<2;++i){
			a=a.r(RegLink,"$1<"+tag+">"+"$2"+"</"+tag+">$9").r(RegMail,"$1<"+tag+">"+"$2"+"</"+tag+">$7");
		}

		/** Экранирование ссылок **/
		z=shield(z);
		/** Замена html символов на обычные **/
		for(var i=0;i<htmlsym.length;++i){
			a=a.r(r("&"+htmlsym[i]+";","g"),normsym[i]);
		}


		/** Замена всех кучерявых кавычек на обычные **/
		if(t("quotes")){
			a=a.r(/«|»|”|“|„/g,'"');
			if(TYPO.language!="eng"){
				a=a.r(/‚|‘/g,'"');
			}
		}

		/** Простановка пробелов и nbsp **/
		if(t("spaces")){

			a=a.r(/([\d]) ?(€|£|л\.|[скм]?м[\/\^¹²³\.\s]|г[аг]?[\s\.]|ц\.|т[\s\.]|р\.|руб\.|уе|тыс\.|млн|млрд)/g, "$1 $2").r(/([\d]) г\.[  ]?г\./g,"$1 гг.").r(/([IVXLCDM]) ?(вв?\.)/g,"$1 $2").r(/([IVXLCDM]) в\.[  ]?в\./g,"$1 вв.");
			a=a.r(/([^\d]|^)([\d]+(?:[\.,][\d]+)?) ?\$/g,"$1$$$2").r(/(\,|;|:|!|\?|\))([^\d\s=?!:,\.'’‘‚"«»“”\[])/gi,"$1 $2").r(/(\[color=[^\n]*\])( | )( | )( | )( | )/g,"$2"+"$3"+"$4"+"$5"+"$1").r(/ {2,}/g," ").r(/\.([^\s\dA-Za-z\n=?:;,\.'’‘"»„“”\[]+)/gi,". $1").r(/([А-яёЁ])\.([^\sA-Za-z\n=?:;,\.'’‘"»„“”\[]+)/g,"$1. $2").r(/ (\.|,|!|\?|;|:)/g,"$1").r(/(—|–|-)\.{2,4} /g,"$1 ...").r(/(\n|^|&)( *)\.{2,4} /g,"$1"+"$2...").r(/(['‘‚"«„“\(])\.{2,4} /g,"$1...").r(/\( /g,"(").r(/ \)/g,")").r(/([^\s])\(/g, "$1 (").r(/([^\d])(,|\.)([\d])/g,"$1"+"$2 $3").r(/(!|\?|\))([^\s=?!:,\.'’‘‚"«»“”\[]+)/gi,"$1 $2").r(/ %/g,"%").r(/P\. ?P\. ?S\./g,"P. P. S.").r(/P\. ?S\./g,"P. S.").r(/и др\./g,"и др.").r(/([\s]|^)(гл?|ул|д|илл)\. ([A-Za-zА-яёЁ0-9])/g,"$1"+"$2. $3").r(/(\s|^)([тнсюзв])\. ?([еочнпдшдэ])\./g,"$1"+"$2. $3.").r(/(\s|^)т\.? ?([нпдч])\./g,"$1т. $2.").r(/ н\. э\./g," н. э").r(/([№§]) ?([\dIVXLCDM])/g,"$1 $2").r(/(\d)([lpd]pi)([\s,\.!?]|$)/g,"$1 $2"+"$3").r(/ГОСТ /gi,"ГОСТ ").r(/ГОСТ Р /gi,"ГОСТ Р ").r(/([\s]|^)до[  ]нэ\./g,"$1до н. э.");
			a=a.r(/ {2,}/g," ");
			//;.r(/(\,|!|\?)([^\d\n=?:,\.'’"»“”\[]+)/gi,"$1 $2");
			//.r(/([^^\n] {0,2})? {2,}/g,"$1 ")
			//a=a.r(/ /g," ");
			//var sp='(к|с|у|о|в|до|из|но|на|по|от|об|за|при|над|под|про|для|без|перед|через|и|а|да|или|либо|зато|однако|чтобы|едва|ибо|пока|кол[иь]|пусть)';
			/** Простановка неразрывного пробела после предлогов, союзов **/
			for(var i=0;i<2;++i){
				a=a.r(/([  \n\t\v]|^)([иаксуов]|же|до|из|н[аое]|по|о[тб]|за|как|что|при|для|над|под|про|или|ибо|без|если|едва|либо|зато|пока|дабы|ежели|когда|перед|чтобы|через|пусть|будто|однако|словно) ([А-яёЁ])/gi,"$1"+"$2 $3");
			}
		}

		/** Тире, дефисы **/
		if(t("dashs")){
			if(TYPO.language!="eng"){
				//a=a.r(/([A-Za-zА-яёЁ]+)(—|–)([A-Za-zА-яёЁ]+)/gi,"$1-$3");
				a=a.r(/(\s|^|<p>)([«"„‚]*)(-|–)([\s]|$)/g, "$1"+"$2—$4");
				a=a.r(/([A-Za-zА-яёЁ0-9]) —/g, "$1 —");
				a=a.r(/([\.,!?] |\n|^|<p>)— ([A-Za-zА-яёЁ0-9«"„‚])/g, "$1— $2");
				//Расстановка дефисов
				var mst="(где|зачем|как|какая|какие|каким|каких|какое|какой|какого|каком|какому|кем|когда|кого|ком|кому|кто|куда|откуда|почему|чего|чем|чему|что|чём)";
				a=a.r(r("([^А-яёЁ]|^)"+mst+"[  ]?(то|либо|нибудь)([^А-яёЁ]|$)","gi"),"$1"+"$2-$3"+"$4").r(r("([^А-яёЁ]|^)"+mst+"[  ]?(то|либо|нибудь)([^А-яёЁ]|$)","gi"),"$1"+"$2-$3"+"$4").r(r("([^А-яёЁ]|^)(кое|кой)[  ]?"+mst+"([^А-яёЁ]|$)","gi"),"$1"+"$2-$3"+"$4").r(r("([^А-яёЁ]|^)(кое|кой)[  ]?"+mst+"([^А-яёЁ]|$)","gi"),"$1"+"$2-$3"+"$4").r(/([\s]|^)(из)[  ]?(за)([\s]|$)/gi,"$1"+"$2-$3"+"$4").r(/([\s]|^)(из)[  ]?(под)([\s]|$)/gi,"$1"+"$2-$3"+"$4").r(/([А-яёЁ]{2,}) (ка|кась)([\s,\.\?!]|$)/g,"$1-$2"+"$3").r(/([^А-яёЁ]|^)(вс[ёе]|так)[  ]?(таки)([^А-яёЁ]|$)/gi,"$1"+"$2-$3"+"$4").r(/(ГОСТ(?:[  ]Р))?[  ]([\d\.]+)-([\d]+)/gi,"$1 $2–$3");
				//Расстановка тире в датах
				a=a.r(/([IVXLCDM]{1,3})-([IVXLCDM]{1,3})[  ]?вв?\.?([\s\.,?!;\)])/g,"$1—$2 вв.$3").r(/([\d]{1,4})-([\d]{1,4})[  ]?гг?\.([\s\.,?!;\)])/g,"$1–$2 гг.$3").r(/([^\d]|^)([0-2][0-9]:[0-5][0-9])-([0-2][0-9]:[0-5][0-9])([^\d]|$)/g,"$1"+"$2–$3"+"$4")/*.r(/(\s|^)([IVXLСDМ]+)-{1,2}([IVXLСDМ]+)(\s|$)/g,"$1"+"$2—$3"+"$4")*/;
				var mo="(?:[ьяюе]|[её]м)";
				var to="(?:[ауе]|ом)";
				var month="(январ"+mo+"|феврал"+mo+"|март"+to+"|апрел"+mo+"|ма(?:[йяюе]|ем)|ию[нл]"+mo+"август"+to+"|сентябр"+mo+"|ноябр"+mo+"|октябр"+mo+"|декабр"+mo+")";
				a=a.r(r("([\\s]|^)([1-3]?[\\d])-([1-3]?[\\d])[  ]?"+month+"([^А-яёЁ]|$)","gi"), "$1"+"$2–$3 $4"+"$5").r(r("([^А-яёЁ]|^)"+month+"-"+month+"([^А-яёЁ]|&)","gi"),"$1"+"$2—$3"+"$4");
			}
			a=a.r(/(\d)--(\d)/g, '$1–$2').r(/([^-]|\s|^)--([^-]|$|\n)/g, '$1—$2').r(/([^-\d]|^)(\d+)-(\d+)([^-\d]|$)/g,"$1"+"$2−$3"+"$4").r(/([^a-z][a-z]|[Α-Ωα-ω+=*\/])-(\d)/g,"$1−$2")/*.r(/([A-Za-z\s]|^)-(\d+)([^-\d]|$)/g,"$1"+sym[20]+"$2"+"$3").r(/([^-\d]|^)(\d+)-([A-Za-z])/g,"$1"+"$2"+sym[20]+"$3")*/;
		}
		/** Замена прочих символов **/
		if(t("chars")){
			//Не заменяю ... на … из практических соображений: ?.. !.. ?!.
			a=a.r(/…/g,"...").r(/([^\.])\.{2,4}/g,"$1...").r(/(\?!|!\?)\.{3}/g,"?!.").r(/\?\.{3}/g,"?..").r(/!\.{3}/g,"!..").r(/(!+)(\?+)/g,"$2"+"$1").r(/(\d+?)[xх](\d+?)/g,"$1×$2").r(/(\d+?)([  ])[xх]([  ])(\d+?)/g,"$1×$4").r(/([0-9a-zA-ZΑ-Ωα-ωА-яёЁ])\^([0-9]+)/g,function($0,$1,$2){
				var l="0123456789", g="⁰¹²³⁴⁵⁶⁷⁸⁹";
				var re=$2;
				for(var j=0;j<10;++j){
					re=re.r(r(l.charAt(j),"g"),g.charAt(j));
				}
				return $1+re;
			}).r(/!=/g,"≠").r(/\+\/[\-−]/g,"±").r(/~=/g,"≈").r(/<=/g,"≤").r(/>=/g,"≥").r(/<->/g,"↔").r(/<-([^-]|&)/g,"←$1").r(/([^-]|^)->/g,"$1→").r(/(!+)(\?+)/g,"$2"+"$1").r(/\?{3,}/g,"???").r(/!{3,}/g,"!!!");
			//Дроби
			var t1="([^0-9A-Za-zА-яёЁ\/]|^)",t2="([^0-9A-Za-zА-яёЁ\/]|$)";
			a=a.r(r(t1+"1\/2"+t2,"g"),"$1½$2").r(r(t1+"1\/4"+t2,"g"),"$1¼$2").r(r(t1+"2\/4"+t2,"g"),"$1½$2").r(r(t1+"3\/4"+t2,"g"),"$1¾$2").r(r(t1+"1\/3"+t2,"g"),"$1⅓$2").r(r(t1+"2\/3"+t2,"g"),"$1⅔$2").r(r(t1+"1\/5"+t2,"g"),"$1⅕$2").r(r(t1+"2\/5"+t2,"g"),"$1⅖$2").r(r(t1+"3\/5"+t2,"g"),"$1⅗$2").r(r(t1+"4\/5"+t2,"g"),"$1⅘$2").r(r(t1+"1\/6"+t2,"g"),"$1⅙$2").r(r(t1+"2\/6"+t2,"g"),"$1⅓$2").r(r(t1+"3\/6"+t2,"g"),"$1½$2").r(r(t1+"4\/6"+t2,"g"),"$1⅔$2").r(r(t1+"5\/6"+t2,"g"),"$1⅚$2").r(r(t1+"1\/8"+t2,"g"),"$1⅛$2").r(r(t1+"2\/8"+t2,"g"),"$1¼$2").r(r(t1+"3\/8"+t2,"g"),"$1⅜$2").r(r(t1+"4\/8"+t2,"g"),"$1½$2").r(r(t1+"5\/8"+t2,"g"),"$1⅝$2").r(r(t1+"6\/8"+t2,"g"),"$1¾$2").r(r(t1+"7\/8"+t2,"g"),"$1⅞$2").r(/,+/g,",").r(/:+/g,":").r(/;+/g,";").r(/([a-zA-ZА-яёЁ0-9]) (а|но)([\s$,]|\.\.\.)/g, "$1, $2"+"$3").r(/([a-zA-ZА-яёЁ0-9]) однако([\s$,\.!?:])/g, "$1, однако"+"$2");
			a=a.r(/([^a-zА-яёЁ]|^)([a-zА-яёЁ]+)[  ](\2)([^a-zA-ZА-яёЁ]|$)/gi,"$1"+"$2"+"$4");
			//if(typoall)
				//	a=a.r(/^(\.| ?|,)/g,"");
		}
		//a=a.r(/(http|ftp|sttp|javascript)\: ([^,]+?)/gi,"$1:$2").r(/(href|src)="([^"]+?)"|/g,function(a,b,c){return a.r(/ ?/g,"")});
		/** Расстановка кучерявых кавычек **/
		if(t("quotes")){
			/*.r(/«|»|”|“|„/g,'"')*/ //См. выше
			/** Предварительная расстановка «ёлочек» **/
			a=a.r(/(^|\n|\s|—|-|\()"/g,"$1«").r(/"($|\n|\s|—|-|\.|,|!|\?|:|;|\))/g,"»$1").r(/«\)/g,"»)").r(/«( ?)/g,"«").r(/( ?)»/g,"»").r(/>"/g,">«").r(/"</g,"»<").r(/«""/g,"«««").r(/«"/g,"««").r(/""»/g,"»»»").r(/"»/g,"»»").r(/("{2}|"»)/g,"»»").r(/$"/g,"«").r(/([A-Za-zа-яА-ЯёЁ])'/g,"$1’");
			a=a.r(/[a-zA-ZА-яёЁ]"-/g,"$1»-").r(/-"[a-zA-ZА-яёЁ]/g,"-«$1");
			//Добиваем оставшиеся кавычки как можем
			a=a.r(/(^[^«»]*)"/g,"$1«").r(/"([^«»]*$)/g,"»$1").r(/«([^«»]*)"/g,"«$1»").r(/"([^«»]*)»/g,"«$1»");
			/** Замена вложенных «ёлочек» и „лапок“ на „лапки“ и ‚коготки‘ **/
			if(TYPO.language!="eng"){
				function rl(i,j){//r_leveled
					var b="",c,d="";
					if(i!=0){
						b=a.substring(0, i);
					}
					if(j!=a.length-1){
						d=a.substring(j+1, a.length);
					}
					c=a.substring(i,j+1);
					for(var i=0;i<32;++i){
						c=c.r(/«([^«»]*)«([^»]*)»/g,"«$1„$2“");
						c=c.r(/„([^„“]*)„([^“]*)“/g,"„$1‚$2‘");
					}
					return b+c+d;
				}
				var level=0;
				for(var i=0;i<a.length;++i){
					if (a.charAt(i)=='«'){
						++level;
						for(var j=i+1;j<a.length;++j){
							if (a.charAt(j)=='«'){
								++level;
							}
							if(a.charAt(j)=='»'){
								--level;
								if(level<=0){
									a=rl(i,j);//r_leveled
									i=j;
									break;
								}
							}
						}
						level=0;
					}
				}
			}
			else{
				a=a.r(/'([A-Za-zа-яА-ЯёЁ])/g,"‘$1");
			}
		}

		/** Английские кавычки **/
		if(TYPO.language=="eng"){
			a=a.r(/(»|’)(\.|,|!|\?)/g,"$2"+"$1").r(/«/g,"“").r(/»/g,"”");
		}
		/** Удаление неразрывных пробелов **/
		if(!t("nbsp")){
			a=a.r(/ /g," ");
		}
		a=a.r(/ (\))/g,"$1")/*.r(/(н\. э|т\. д|т\. д|т \. п|т \.к|г \.|\. т \. д)/g,function(a,b){return b.r(/ /g," ")})*/;
		/** Преобразование обычных символов в коды **/
		for(var i=0;i<normsym.length;++i){
			a=a.r(r(normsym[i],"g"),"&"+htmlsym[i]+";");
		}
		/** Разэкранирование **/
		for(var i=m.length-1;i>=0;--i){
			a=a.r("UNTYPO"+i+"S",/*"<"+tag+">"+*/m[i]/*+"</"+tag+">"*/)
		}
		a=a.r(r("(<\\/?"+tag+">)+","g"),"$1");
		//if(lochash=="forum")a=a.r(r("(<\\/?"+tag+">)+","g"),"");
		return a;
	}

	return {
		init: function(elements) {

			for (var i = 0; i<elements.length; i++){
				elements[i].innerHTML = runTypograf(elements[i].innerHTML);
			}
		}
	};

})();

document.addEventListener('DOMContentLoaded', function(event) {
    typo.init(document.querySelectorAll('.content'));
});
